In [8]:
#Membagi Data Frame menjadi dua secara acak

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   4   9  15   2   4
1  12  10   2  17  14
2   3   1   8   1  11
3  16  16   1  15  12
4   4   9  14  15   1
5  19   8   7  13   2
6  12  19   4   7  17
7   7   9   2  15   7
8   6   6   6  15  12
9   1   4   9  14   7

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [5]:
df_1

    A   B   C   D   E
8   6   6   6  15  12
1  12  10   2  17  14
3  16  16   1  15  12
4   4   9  14  15   1
2   3   1   8   1  11
0   4   9  15   2   4
9   1   4   9  14   7

In [6]:
df_2

    A   B  C   D   E
5  19   8  7  13   2
6  12  19  4   7  17
7   7   9  2  15   7

In [7]:
#Mengganti nama (label) kolom pada Data Frame berdasarkan pola

In [14]:
import pandas as pd
import os

print(os.getcwd())
print(pd.__version__)

c:\Users\josua\Desktop\Semester 3\VISUALISASI DATA\Pandas
2.3.3

In [23]:
df = pd.read_csv('titanicfull.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
df = pd.read_csv('titanicfull.csv')
df_backup = df.copy(deep=True)

In [30]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
#Melakukan seleksi kolom dan baris pada Data Frame menggunakan loc

In [32]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   3  10  10  18  10
1   3  17  10  19   5
2  16   9  12  12   9
3   7   1   9  11   9
4   9   1  12   6  17
5   7   2   9   4  13
6   7  14   7  11  13
7  13   3   7  12  13
8  14   1  10  16  12
9   1   1   2  11  11

In [33]:
df.loc[[0,3,4], ['B','E']]

    B   E
0  10  10
3   1   9
4   1  17

In [34]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
1  17  19   5
6  14  11  13

In [35]:
df.loc[0:4, 'B':'D']

    B   C   D
0  10  10  18
1  17  10  19
2   9  12  12
3   1   9  11
4   1  12   6

In [36]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [37]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penaggalan
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [38]:
df.dtypes

day                    int64
month                  int64
year                   int64
penaggalan    datetime64[ns]
dtype: object